MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx254f128b.h
/*-------------------------------------------------------------------------
 * PIC32MX254F128B processor header
 * Build date : Jul 28 2020
 *
 * Copyright (c) 2020, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution. Publication is not required when this file 
 *         is used in an embedded application.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#pragma once
#ifndef __32MX254F128B_H
#define __32MX254F128B_H

#if defined (__LANGUAGE_C__) || defined (__LANGUAGE_C_PLUS_PLUS)

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#define DSCON DSCON
extern volatile uint32_t   DSCON __attribute__((section("sfrs"), address(0xBF800000)));
typedef union {
  struct {
    uint32_t RELEASE:1;
    uint32_t DSBOR:1;
    uint32_t WAKEDIS:1;
    uint32_t :5;
    uint32_t RTCCWDIS:1;
    uint32_t :3;
    uint32_t RTCDIS:1;
    uint32_t DSGPREN:1;
    uint32_t :1;
    uint32_t DSEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DSCONbits_t;
extern volatile __DSCONbits_t DSCONbits __asm__ ("DSCON") __attribute__((section("sfrs"), address(0xBF800000)));
#define DSWAKE DSWAKE
extern volatile uint32_t   DSWAKE __attribute__((section("sfrs"), address(0xBF800010)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t DSMCLR:1;
    uint32_t DSRTC:1;
    uint32_t DSWDT:1;
    uint32_t :2;
    uint32_t DSFLT:1;
    uint32_t DSINT0:1;
  };
  struct {
    uint32_t w:32;
  };
} __DSWAKEbits_t;
extern volatile __DSWAKEbits_t DSWAKEbits __asm__ ("DSWAKE") __attribute__((section("sfrs"), address(0xBF800010)));
#define DSGPR0 DSGPR0
extern volatile uint32_t   DSGPR0 __attribute__((section("sfrs"), address(0xBF800020)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR0bits_t;
extern volatile __DSGPR0bits_t DSGPR0bits __asm__ ("DSGPR0") __attribute__((section("sfrs"), address(0xBF800020)));
#define DSGPR1 DSGPR1
extern volatile uint32_t   DSGPR1 __attribute__((section("sfrs"), address(0xBF800040)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR1bits_t;
extern volatile __DSGPR1bits_t DSGPR1bits __asm__ ("DSGPR1") __attribute__((section("sfrs"), address(0xBF800040)));
#define DSGPR2 DSGPR2
extern volatile uint32_t   DSGPR2 __attribute__((section("sfrs"), address(0xBF800044)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR2bits_t;
extern volatile __DSGPR2bits_t DSGPR2bits __asm__ ("DSGPR2") __attribute__((section("sfrs"), address(0xBF800044)));
#define DSGPR3 DSGPR3
extern volatile uint32_t   DSGPR3 __attribute__((section("sfrs"), address(0xBF800048)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR3bits_t;
extern volatile __DSGPR3bits_t DSGPR3bits __asm__ ("DSGPR3") __attribute__((section("sfrs"), address(0xBF800048)));
#define DSGPR4 DSGPR4
extern volatile uint32_t   DSGPR4 __attribute__((section("sfrs"), address(0xBF80004C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR4bits_t;
extern volatile __DSGPR4bits_t DSGPR4bits __asm__ ("DSGPR4") __attribute__((section("sfrs"), address(0xBF80004C)));
#define DSGPR5 DSGPR5
extern volatile uint32_t   DSGPR5 __attribute__((section("sfrs"), address(0xBF800050)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR5bits_t;
extern volatile __DSGPR5bits_t DSGPR5bits __asm__ ("DSGPR5") __attribute__((section("sfrs"), address(0xBF800050)));
#define DSGPR6 DSGPR6
extern volatile uint32_t   DSGPR6 __attribute__((section("sfrs"), address(0xBF800054)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR6bits_t;
extern volatile __DSGPR6bits_t DSGPR6bits __asm__ ("DSGPR6") __attribute__((section("sfrs"), address(0xBF800054)));
#define DSGPR7 DSGPR7
extern volatile uint32_t   DSGPR7 __attribute__((section("sfrs"), address(0xBF800058)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR7bits_t;
extern volatile __DSGPR7bits_t DSGPR7bits __asm__ ("DSGPR7") __attribute__((section("sfrs"), address(0xBF800058)));
#define DSGPR8 DSGPR8
extern volatile uint32_t   DSGPR8 __attribute__((section("sfrs"), address(0xBF80005C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR8bits_t;
extern volatile __DSGPR8bits_t DSGPR8bits __asm__ ("DSGPR8") __attribute__((section("sfrs"), address(0xBF80005C)));
#define DSGPR9 DSGPR9
extern volatile uint32_t   DSGPR9 __attribute__((section("sfrs"), address(0xBF800060)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR9bits_t;
extern volatile __DSGPR9bits_t DSGPR9bits __asm__ ("DSGPR9") __attribute__((section("sfrs"), address(0xBF800060)));
#define DSGPR10 DSGPR10
extern volatile uint32_t   DSGPR10 __attribute__((section("sfrs"), address(0xBF800064)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR10bits_t;
extern volatile __DSGPR10bits_t DSGPR10bits __asm__ ("DSGPR10") __attribute__((section("sfrs"), address(0xBF800064)));
#define DSGPR11 DSGPR11
extern volatile uint32_t   DSGPR11 __attribute__((section("sfrs"), address(0xBF800068)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR11bits_t;
extern volatile __DSGPR11bits_t DSGPR11bits __asm__ ("DSGPR11") __attribute__((section("sfrs"), address(0xBF800068)));
#define DSGPR12 DSGPR12
extern volatile uint32_t   DSGPR12 __attribute__((section("sfrs"), address(0xBF80006C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR12bits_t;
extern volatile __DSGPR12bits_t DSGPR12bits __asm__ ("DSGPR12") __attribute__((section("sfrs"), address(0xBF80006C)));
#define DSGPR13 DSGPR13
extern volatile uint32_t   DSGPR13 __attribute__((section("sfrs"), address(0xBF800070)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR13bits_t;
extern volatile __DSGPR13bits_t DSGPR13bits __asm__ ("DSGPR13") __attribute__((section("sfrs"), address(0xBF800070)));
#define DSGPR14 DSGPR14
extern volatile uint32_t   DSGPR14 __attribute__((section("sfrs"), address(0xBF800074)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR14bits_t;
extern volatile __DSGPR14bits_t DSGPR14bits __asm__ ("DSGPR14") __attribute__((section("sfrs"), address(0xBF800074)));
#define DSGPR15 DSGPR15
extern volatile uint32_t   DSGPR15 __attribute__((section("sfrs"), address(0xBF800078)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR15bits_t;
extern volatile __DSGPR15bits_t DSGPR15bits __asm__ ("DSGPR15") __attribute__((section("sfrs"), address(0xBF800078)));
#define DSGPR16 DSGPR16
extern volatile uint32_t   DSGPR16 __attribute__((section("sfrs"), address(0xBF80007C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR16bits_t;
